clear all

A = imread('./1.jpg');

 

subplot(1,4,1);

imshow(A);

title('原始图像');

 

B = double(A);

x11=[1,1,1];

x12=[0,1,0];

x13=[1,0,1];

x21=[0,0,0];

x22=[1,1,1];

x23=[0,0,0];

x31=[0,0,0];

x32=[0,0,0];

x33=[1,1,1];

 

for i = 1:3

C(:,:,1) = x11(i)*B(:,:,1)+x12(i)*B(:,:,2)+x13(i)*B(:,:,3);

C(:,:,2) = x21(i)*B(:,:,1)+x22(i)*B(:,:,2)+x23(i)*B(:,:,3);

C(:,:,3) = x31(i)*B(:,:,1)+x32(i)*B(:,:,2)+x33(i)*B(:,:,3);

 

C(find(C>255)) = 255;

C(find(C<0)) = 0;

 

C=uint8(C);

 

subplot(1,4,i+1);

imshow(C);

title('通道运算后的图像');

end

 



 

 

clear all

A = imread('./1.jpg');

 

subplot(1,4,1);

imshow(A);

title('原始图像');

 

B = double(A);

x11=[1,1,1];

x12=[0,0,0];

x13=[0,0,0];

x21=[1,0,1];

x22=[1,1,1];

x23=[0,1,0];

x31=[0,0,0];

x32=[0,0,0];

x33=[1,1,1];

 

for i = 1:3

C(:,:,1) = x11(i)*B(:,:,1)+x12(i)*B(:,:,2)+x13(i)*B(:,:,3);

C(:,:,2) = x21(i)*B(:,:,1)+x22(i)*B(:,:,2)+x23(i)*B(:,:,3);

C(:,:,3) = x31(i)*B(:,:,1)+x32(i)*B(:,:,2)+x33(i)*B(:,:,3);

 

C(find(C>255)) = 255;

C(find(C<0)) = 0;

 

C=uint8(C);

 

subplot(1,4,i+1);

imshow(C);

title('通道运算后的图像');

end

 



 

 

 

 

 

 

 

clear all

A = imread('./1.jpg');

 

subplot(1,4,1);

imshow(A);

title('原始图像');

 

B = double(A);

x11=[1,1,1];

x12=[0,0,0];

x13=[0,0,0];

x21=[0,0,0];

x22=[1,1,1];

x23=[0,0,0];

x31=[1,0,1];

x32=[0,1,0];

x33=[1,1,1];

 

 

for i = 1:3

C(:,:,1) = x11(i)*B(:,:,1)+x12(i)*B(:,:,2)+x13(i)*B(:,:,3);

C(:,:,2) = x21(i)*B(:,:,1)+x22(i)*B(:,:,2)+x23(i)*B(:,:,3);

C(:,:,3) = x31(i)*B(:,:,1)+x32(i)*B(:,:,2)+x33(i)*B(:,:,3);

 

C(find(C>255)) = 255;

C(find(C<0)) = 0;

 

C=uint8(C);

 

subplot(1,4,i+1);

imshow(C);

title('通道运算后的图像');

end

 

